In [38]:
from pydataset import data

In [2]:
import pandas as pd
import numpy as np

In [3]:
np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

In [4]:
print(df)

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

# 1.Copy the code from the lesson to create a dataframe full of #student grades.

#    a. Create a column named passing_english that indicates #whether each student has a passing grade in english.

In [5]:
df['passing_english']= df.english > 70

In [6]:
df

       name  math  english  reading  passing_english
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
9   Richard    69       80       94             True
10    Isaac    92       99       93             True
11     Alan    92       62       72            False

In [7]:
# 1b. Sort the english grades by the passing_english column. How are duplicates handled?
df.sort_values(by='passing_english')

       name  math  english  reading  passing_english
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
11     Alan    92       62       72            False
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
9   Richard    69       80       94             True
10    Isaac    92       99       93             True

In [15]:
# 1c. Sort the english grades first by passing_english and then by student name. All the 
#students that are failing english should be first, and within the students that are failing 
#english they should be ordered alphabetically. The same should be true for the students 
#passing english. (Hint: you can pass a list to the .sort_values method)

df.sort_values(by='passing_english').sort_values(by='name')

       name  math  english  reading  passing_english
4       Ada    77       92       98             True
11     Alan    92       62       72            False
8    Albert    92       62       87            False
3     Billy    98       96       88             True
10    Isaac    92       99       93             True
1      Jane    88       79       67             True
5      John    79       76       93             True
7     Marie    93       63       90            False
9   Richard    69       80       94             True
0     Sally    62       85       80             True
2     Suzie    94       74       95             True
6    Thomas    82       64       81            False

In [28]:
df.sort_values(by='english < 70').sort_values(by='passing_english').name

KeyError: 'english < 70'

In [25]:
# 1d. Sort the english grades first by passing_english, and then by the actual english 
#grade, similar to how we did in the last step.

df.sort_values(by='passing_english').sort_values(by='english')

       name  math  english  reading  passing_english
8    Albert    92       62       87            False
11     Alan    92       62       72            False
7     Marie    93       63       90            False
6    Thomas    82       64       81            False
2     Suzie    94       74       95             True
5      John    79       76       93             True
1      Jane    88       79       67             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
4       Ada    77       92       98             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True

In [57]:
# 1e. Calculate each students overall grade and add it as a column on the dataframe. 
#The overall grade is the average of the math, english, and reading grades.

df['overall_grade'] = df.mean()
df

       name  math  english  reading  passing_english  overall_grade
0     Sally    62       85       80             True            NaN
1      Jane    88       79       67             True            NaN
2     Suzie    94       74       95             True            NaN
3     Billy    98       96       88             True            NaN
4       Ada    77       92       98             True            NaN
5      John    79       76       93             True            NaN
6    Thomas    82       64       81            False            NaN
7     Marie    93       63       90            False            NaN
8    Albert    92       62       87            False            NaN
9   Richard    69       80       94             True            NaN
10    Isaac    92       99       93             True            NaN
11     Alan    92       62       72            False            NaN

In [35]:
# 2. Load the mpg dataset. Read the documentation for the dataset and use it for the 
#following questions:

mpg = data('mpg')

In [40]:
# 2a.How many rows and columns are there?
print(mpg)
# 234 rows x 11 columns

    manufacturer   model  displ  year  cyl       trans drv  cty  hwy fl  \
1           audi      a4    1.8  1999    4    auto(l5)   f   18   29  p
2           audi      a4    1.8  1999    4  manual(m5)   f   21   29  p
3           audi      a4    2.0  2008    4  manual(m6)   f   20   31  p
4           audi      a4    2.0  2008    4    auto(av)   f   21   30  p
5           audi      a4    2.8  1999    6    auto(l5)   f   16   26  p
..           ...     ...    ...   ...  ...         ...  ..  ...  ... ..
230   volkswagen  passat    2.0  2008    4    auto(s6)   f   19   28  p
231   volkswagen  passat    2.0  2008    4  manual(m6)   f   21   29  p
232   volkswagen  passat    2.8  1999    6    auto(l5)   f   16   26  p
233   volkswagen  passat    2.8  1999    6  manual(m5)   f   18   26  p
234   volkswagen  passat    3.6  2008    6    auto(s6)   f   17   26  p

       class
1    compact
2    compact
3    compact
4    compact
5    compact
..       ...
230  midsize
231  midsize
232  midsize
233  midsize
234  midsize

[234 rows x 11 columns]

In [42]:
# 2b. What are the data types of each column?
mpg.dtypes

manufacturer     object
model            object
displ           float64
year              int64
cyl               int64
trans            object
drv              object
cty               int64
hwy               int64
fl               object
class            object
dtype: object

In [43]:
# 2c. Summarize the dataframe with .info and .describe
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [44]:
# 2c. Summarize the dataframe with .info and .describe
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [46]:
# 2d. Rename the cty column to city.
mpg.rename(columns={'cty': 'city'})

,manufacturer,model,displ,year,cyl,trans,drv,city,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [50]:
# 2e. Rename the hwy column to highway.
mpg.rename(columns={'hwy': 'highway'}).rename(columns={'cty' : 'city'})

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [52]:
# 2f. Do any cars have better city mileage than highway mileage?
mpg.sort_values(by='cty')

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
60,dodge,durango 4wd,4.7,2008,8,auto(l5),4,9,12,e,suv
55,dodge,dakota pickup 4wd,4.7,2008,8,auto(l5),4,9,12,e,pickup
70,dodge,ram 1500 pickup 4wd,4.7,2008,8,manual(m6),4,9,12,e,pickup
66,dodge,ram 1500 pickup 4wd,4.7,2008,8,auto(l5),4,9,12,e,pickup
127,jeep,grand cherokee 4wd,4.7,2008,8,auto(l5),4,9,12,e,suv
...,...,...,...,...,...,...,...,...,...,...,...
100,honda,civic,1.6,1999,4,manual(m5),f,28,33,r,subcompact
197,toyota,corolla,1.8,2008,4,manual(m5),f,28,37,r,compact
223,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact

In [55]:
# 2g. Create a column named mileage_difference this column should contain the difference 
#between highway and city mileage for each car.
mpg['mileage_difference'] = mpg.ctmy
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,18
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,21
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,20
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,21
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,16
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,19
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,21
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,16
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,18
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,17

In [ ]:
# 2h. Which car (or cars) has the highest mileage difference?

In [ ]:
# 2i. Which compact class car has the lowest highway mileage? The best?

In [ ]:
# 2j. Create a column named average_mileage that is the mean of the city and highway mileage.

In [ ]:
# 2k. Which dodge car has the best average mileage? The worst?

In [ ]:
# 3. Load the Mammals dataset. Read the documentation for it, and use the data to answer these questions:

In [ ]:
# 3a. How many rows and columns are there?

In [ ]:
# 3b. What are the data types?

In [ ]:
# 3c. Summarize the dataframe with .info and .describe

In [ ]:
# 3d. What is the the weight of the fastest animal?

In [ ]:
# 3e. What is the overal percentage of specials?

In [ ]:
# 3f. How many animals are hoppers that are above the median speed? What percentage is this?